fix: updated readme files with mermaid diagrams
